app/views/users/likes.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
---
      <!-- 変数postを定義してください -->
      <% post = Post.find_by(id: like.post_id) %>