app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
    @user = @post.user
    @likes_count = Like.where(post_id:@post.id).count
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 39]]

  def create
    post = Post.new(post_params)
    post.user_id = @current_user.id
    if post.save
---
INSERT INTO "posts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-10-05 07:50:24.273017"], ["updated_at", "2019-10-05 07:50:24.273017"]]

  def update
    post = Post.find(params[:id])
    if post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "こんにち"], ["updated_at", "2019-10-08 04:34:13.544307"], ["id", 28]]

  def destroy
    post = Post.find(params[:id])
    post.delete
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]