app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?)  [["name", "aki"], ["email", "aki"], ["created_at", "2019-10-08 11:31:57.258467"], ["updated_at", "2019-10-08 11:31:57.258467"], ["password", "aki"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "にこにこ"], ["email", "niko@mail.com"], ["updated_at", "2019-10-01 10:04:53.608164"], ["id", 9]]
---
  def update
    user = User.find(params[:id])
    if user.image_name
      user.image_name = "#{user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{user.image_name}", image.read)
    end
    if user.update(user_params)